### 2. 데이터 입출력

In [1]:
import numpy as np
import pandas as pd

- %%writefile 매직 명령어
    - 셀에 서술한 내용대로 텍스트 파일을 만드는 명령

In [ ]:
# data폴더에 sample1.csv파일 만들어짐 / ,하고 공백없애기
# 인덱스는 나중에 조작방법이 있음
''' 
c1,c2,c3  # 첫번째는 컬럼명 또는 names=[] 로 줄수있음 ex_names=['c1','c2','c3']
1,1.11,one # 나머지는 data
2,2.22,two # data
3,3.33,three # data
'''

In [8]:
%%writefile data/sample1.csv 
c1,c2,c3
1,1.11,one
2,2.22,two
3,3.33,three

UsageError: Line magic function `%%writefile` not found.

- CSV 파일 읽기
    - CSV 파일로부터 데이터를 읽어 데이터프레임을 만들 때는 pandas.read_csv 함수를 사용한다. 함수의 입력값으로 파일 이름을 넣는다.

In [9]:
df = pd.read_csv('data/sample1.csv') # data폴더안에있는 sample1.cvc파일 가져와서 데이터프레임만들어라
df

   c1    c2     c3
0   1  1.11    one
1   2  2.22    two
2   3  3.33  three

In [10]:
df.columns # ' c2' 공백까지 포함해서 열이름이다.
# 'c2' 위에서 공백없애줬음

Index(['c1', 'c2', 'c3'], dtype='object')

- header line이 생략된 경우
    - 첫번째는 컬럼명인데 생략된경우 names=[] 로 줄수있음 ex_names=['c1','c2','c3']

In [11]:
%%writefile data/sample2.csv 
1,1.11,one
2,2.22,two
3,3.33,three

Writing data/sample2.csv

In [13]:
df = pd.read_csv('data/sample2.csv')
df

   1  1.11    one
0  2  2.22    two
1  3  3.33  three

In [14]:
# names로 columns명 주기
df = pd.read_csv('data/sample2.csv', names=['c1','c2','c3'])
df

   c1    c2     c3
0   1  1.11    one
1   2  2.22    two
2   3  3.33  three

In [15]:
# 행인덱스로 만들려면
# index column 지정
df = pd.read_csv('data/sample1.csv', index_col='c1')
df

      c2     c3
c1
1   1.11    one
2   2.22    two
3   3.33  three

- 탭 또는 여러개의 공백으로 구분된 파일
    - 공백 드래그했을때 ..표시있으면 스페이스된거고 그냥 공백한개로 보이면 그것은 탭

In [16]:
%%writefile data/sample3.tsv
c1  c2  c3  c4
0.179181    -1.538472   1.347553    0.43381
1.024209    0.087307    -1.281997   0.49265
0.417899    -2.002308   0.255245    -1.10515

Writing data/sample3.tsv

In [20]:
df = pd.read_csv('data/sample3.tsv', sep='\s+') # blank 여러개 또는 탭: \s+    #sep구분자(separator)사용하여 각 열을 분리
df
# 공백문자를 구분자로 사용하여 각 열을 분리

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [1]:
# 이렇게 하니까 탭적용 가능 (파일내에서 확인함) 드래그시 공백한개
df.to_csv('data/test.tsv', sep='\t', index=False) # Pandas.to_csv(파일경로명)을 사용해 DataFrame을 CSV 파일로 저장

NameError: name 'df' is not defined

- 여러줄의 header

In [24]:
%%writefile data/sample4.csv
파일 제목: sample4.txt
데이터 포맷의 설명:
c1,c2,c3
1,1.11,one
2,2.22,two
3,3.33,three

Writing data/sample4.csv

In [25]:
df = pd.read_csv('data/sample4.csv', skiprows=2) # 2개의 행을 건너띄어라(파일제목,데이터포맷의설명)
df

   c1    c2     c3
0   1  1.11    one
1   2  2.22    two
2   3  3.33  three

- csv 파일 출력

In [26]:
df.to_csv('data/sample6.csv') # Pandas.to_csv(파일경로명)을 사용해 DataFrame을 CSV 파일로 저장
df = pd.read_csv('data/sample6.csv') # 읽고자 하는 파일을 Pandas.read_csv(파일경로명)에 넘겨주면, 해당 파일을 읽어 DataFrame으로 반환
df

   Unnamed: 0  c1    c2     c3
0           0   1  1.11    one
1           1   2  2.22    two
2           2   3  3.33  three

In [29]:
del df['Unnamed: 0'] # "Unnamed: 0"이라는 이름의 열(column)을 삭제
df.to_csv('data/sample7.csv', index=False) # index=False 중요 Unnamed: 0없애려고
df = pd.read_csv('data/sample7.csv')
df

   c1    c2     c3
0   1  1.11    one
1   2  2.22    two
2   3  3.33  three

In [ ]:
sample7.csv"라는 CSV 파일에서 "Unnamed: 0"이라는 이름의 열(column)을 삭제하고, 
그 결과를 다시 "sample7.csv" 파일로 저장하는 부분과, 
이제 "sample7.csv" 파일을 다시 불러와서 데이터프레임(df)으로 저장하는 부분
인덱스(index) 열(column)을 저장하지 않도록 합니다. 
"index=False" 옵션을 사용하지 않으면, 저장된 CSV 파일에 인덱스 열이 포함되어 저장됩니다.
 "sample7.csv" 파일에서 "Unnamed: 0"이라는 이름의 열(column)이 삭제된 후, 
"sample7.csv" 파일이 다시 저장됩니다. 그리고 그 파일을 다시 불러와서 데이터프레임(df)으로 저장

- 인터넷 상의 파일

In [48]:
df = pd.read_csv("https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv")

In [45]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [46]:
# Name, Ticket column 지우고, data/titanic.csv로 저장 방법1
del df['Ticket'], df['Name']
df.to_csv('data/titanic.csv', index=False)

In [42]:
titanic = pd.read_csv('data/titanic.csv')
titanic.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,71.2833,C85,C
2,3,1,3,female,26.0,0,0,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,53.1000,C123,S
4,5,0,3,male,35.0,0,0,8.0500,NaN,S

In [49]:
# 여러 컬럼을 삭제할 경우에는 drop method를 사용하기도 한다. 방법2
# 실행하는거 보고싶으면 파일을 다시 불러오고 실행해보기
df.drop(columns=['Name', 'Ticket'], inplace=True)
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,71.2833,C85,C
2,3,1,3,female,26.0,0,0,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,53.1000,C123,S
4,5,0,3,male,35.0,0,0,8.0500,NaN,S